OpenFOAM-2.3.x/tutorials/combustion/fireFoam/les/smallPoolFire2D/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.23301;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    sides
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    base
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
